#+TITLE: Remove Watermarks
#+AUTHOR: António Mendes
#+DATE: 10 / 12 / 20
#+email: 17amendes@gmail.com
#+PROPERTY: header-args :exports both :session _rem_mrk :results value
#+OPTIONS: toc:nil num:nil
#+LaTeX_HEADER: \usepackage[left=3.5cm, top=2.5cm, right=3.5cm, includefoot]{geometry}
-----

* Save Translation
#+BEGIN_SRC python
filenames = os.listdir(train_dir)
if ".DS_Store" in filenames:
  filenames.remove(".DS_Store")

no_of_files = len(filenames)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :results file
train_mrk_removed_dir = data_dir / "train_set_watermark_removed"
if train_mrk_removed_dir.exists() == False:
  os.mkdir(train_mrk_removed_dir)

data_dir
#+END_SRC

#+RESULTS:
[[file:/Users/antoniomendes/Desktop/uva_data_science/semester_01/block_02/AML/Kaggle_Project/data]]

#+BEGIN_SRC python
with tf.compat.v1.Session() as sess:
    init = tf.group(tf.compat.v1.global_variables_initializer(),tf.compat.v1.local_variables_initializer())
    sess.run(init)
    tf.compat.v1.train.start_queue_runners()
    for i in tqdm(range(no_of_files)):
        img_tnsr = mark_removed_tensors[i]
        img = sess.run(img_tnsr)
        img = Image.fromarray(img)
        img.save(train_mrk_removed_dir / filenames[i])
#+END_SRC

#+RESULTS:
: []

#+BEGIN_SRC python
for i in tqdm(range(no_of_files)):
  img_tnsr = mark_removed_tensors[i]
  img = sess.run(img_tnsr)
  img = Image.fromarray(img)
  img.save(train_mrk_removed_dir / filenames[i])
#+END_SRC

#+RESULTS:

